# Brewfile - Declarative package management for macOS
# Run: brew bundle --file=packages/Brewfile

# Essential command-line tools
brew "curl"
brew "wget"
brew "git"
brew "stow"

# Development tools
brew "neovim"
brew "tmux"
brew "zsh"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "htop"
brew "mise"
brew "zoxide"
brew "jq"
brew "yq"
brew "tree"
brew "nvm"
brew "uv"

# Casks - GUI Applications
cask "discord"
cask "logi-options+"
cask "font-im-writing-nerd-font"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "orbstack"
cask "slack"
cask "obsidian"
cask "rectangle"
cask "zotero"
cask "skim"
cask "zoom"
cask "firefox"
cask "1password"
cask "tailscale-app"
cask "raycast"
cask "visual-studio-code"

