cask_args appdir: '/Applications'
tap 'homebrew/bundle'

brew 'wget'
brew 'go-task'

cask 'raycast'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed'
cask 'zoom'
cask 'obsidian'
cask 'iterm2'
cask 'docker'
cask 'tailscale'
cask 'lens'
cask 'font-jetbrains-mono-nerd-font'
cask 'microsoft-remote-desktop'
cask 'rectangle'
cask 'microsoft-office'
cask 'logi-options-plus'
cask 'logitune'
cask 'firefox'
